app/controllers/alert_controller.rb

SELECT * FROM `members` WHERE (`members`.`id` = 9) LIMIT 1
---
           def registerreq
			puts "registerreq"
			@members = Member.find(:all,
										:conditions =>  "Reqflag = 'N'")