app/controllers/books_controller.rb

SELECT * FROM `books` LIMIT 0, 5
SELECT count(*) AS count_all FROM `books`
---
  def index
    #@books = Book.all

    @books = Book.paginate(:page => params[:page], :per_page => 5)

SELECT * FROM `books` WHERE (`books`.`id` = 3)
---
  def show
    @book = Book.find(params[:id])

SELECT * FROM `books` WHERE (`books`.`id` = 3)
---
  def edit
    @book = Book.find(params[:id])

INSERT INTO `books` (`NumberOfBorrowedBooks`, `Copyright`, `ISBN`, `Availble`, `NumberOfAvailbleBooks`, `Subject`, `Edition`, `NumberOfBooks`, `Ranking`, `Author`, `Pages`, `mem_id`, `Reserve`, `Title`, `BookID`, `Library`, `Publisher`) VALUES(0, 2005, '212ssdjh4564sdjsh', 'Available', 2, 'marathi', 5, 2, 0, 'mar', 12345, NULL, 'N', 'mara', 501, 'main', 'jsdahj')
---
  def create
    @book = Book.new(params[:book])
    puts @book.NumberOfAvailbleBooks=params[:book][:NumberOfBooks]

    #respond_to do |format|
      if @book.save