app/controllers/extrabook_controller.rb

SELECT * FROM `books` WHERE (Availble='Available')
---
	def availablebooks
		puts "---------------"
		@books = Book.find(:all, :conditions => "Availble='Available'" )

SELECT * FROM `books` WHERE (NumberOfBorrowedBooks > 0 OR Availble = 'Not Available')
---
	def borrowedbooks
		puts "!!!!!!!!!!!!!!"
		@books = Book.find(:all, :conditions => "NumberOfBorrowedBooks > 0 OR Availble = 'Not Available'")