app/controllers/issue_controller.rb

SELECT * FROM `members` WHERE (id = 21) LIMIT 1
---
  def new
     @borrow = Borrow.new
     puts "issue -> new"

        puts session[:user_id]
        @member = Member.find(:first, :conditions => "id = #{session[:user_id]}")