app/controllers/mailer_controller.rb

SELECT * FROM `members` WHERE (`members`.`id` = 9) LIMIT 1
---
  def index
    puts "in index.."
    puts "~~~~~~~~ #{params[:id]} ~~~~~~~~~~~~~~"
    @mail_id = Member.find(:first, :conditions => "MemberID = #{params[:id]}")

SELECT * FROM `members` WHERE (`members`.`id` = 21) LIMIT 1
SELECT * FROM `books` WHERE (BookID = 11) LIMIT 1
---
    def reserve
		puts "in index1.."

		@mem = Member.find(:first,
								:conditions =>" usertype = 'Admin'")
		puts @mail_id=@mem.Email
		p "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
		puts params[:bookid]
		p "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"

    @book = Book.find(:first, :conditions => "BookID = #{params[:bookid]}")

SELECT * FROM `members` WHERE (`members`.`id` = 9) LIMIT 1
SELECT * FROM `members` ORDER BY name
---
    def newarrival

	    #@group=Cluster.find(:all, :order => "ClusterName")

       # for item in @group
         #   @clustarray<< item.ClusterName
        #end
        #len=@clustarray.length

		@mem = Member.find(:all, :order => "name")
		@mail_id=[]

		@mem.each do |item|

SELECT `members`.id FROM `members` WHERE (`members`.`name` = BINARY '\'user1\'' AND `members`.id <> 21) LIMIT 1
UPDATE `members` SET `Reqflag` = 'Y' WHERE `id` = 21
---
    def regmem
		puts "in regmem"
		puts params[:memname]
		@mem = Member.find(:first,
								:conditions => "name = '#{params[:memname]}'")
		puts @mem.MemberID
		@mem.update_attribute( :Reqflag,  'Y')