app/controllers/members_controller.rb

  def show
    @member = Member.find(params[:id])
---
SELECT * FROM `members` WHERE (`members`.`id` IS NULL) LIMIT 1

  def create

    @member = Member.new(params[:member])
    @mem = Member.maximum('MemberID')
		puts @member.Expired

		if @member.Expired==nil
			exdate = Date.today
			puts exdate = exdate + 365
			puts @member.Expired = exdate
		else
			puts "i n 	e l s e"
		end


		if @mem == nil
			puts "--------------"
			@mem=100
	    else
			puts @mem = @mem.to_i + 1
			puts @member.MemberID =  @mem
		end

	if @member.save
---
SELECT max(`members`.MemberID) AS max_memberid FROM `members`
INSERT INTO `members` (`name`, `salt`, `hashed_password`, `MemberID`, `NumberOfBooks`, `usertype`, `Expired`, `Email`, `PhoneNo`, `Address`, `Reqflag`) VALUES('user2', '362462700.229251135534187', 'f081f7e52d4c5b554b35e19ee6c0eb88a46fb880', 104, 0, 'Member', '2011-04-03 18:30:00', 'rahul@sprylogic.com', '12345', 'djhsdjh', 'N')