app/controllers/search_controller.rb

SELECT * FROM `books` WHERE (Subject = 'java') ORDER BY Ranking DESC
---
  def show
    puts "hi"

  #  if params[:search][:select]!=nil  and params[:search][:txtfield]!= nil


    puts @first = params[:search][:select]
    puts @temp = params[:search][:txtfield]

    session[:searchtype] = params[:search][:select]
    session[:searchcontent]  = params[:search][:txtfield]

#    if params[:search][:select].to_i == 1
  #    @books = Book.find(:all, :conditions => "BookID = #{params[:search][:txtfield]}" )



    if session[:searchtype] .to_i == 2
      @books =      Book.find( :all,
                                        :conditions => "Subject = '#{session[:searchcontent]}'",
                                        :order => "Ranking DESC" )

SELECT `books`.id FROM `books` WHERE (`books`.`BookID` = 11 AND `books`.id <> 2) LIMIT 1
SELECT * FROM `members` WHERE (`members`.`id` = 21) LIMIT 1
---
  def reserve
    puts params[:id]

    @book = Book.find(:first, :conditions => "BookID = #{params[:id]}")

    puts session[:user_id]

    @member = Member.find(:first, :conditions => "id = #{session[:user_id]}")